tests/fixtures/nms-aixm-initial-load.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<ns3:FeatureCollection 
xmlns="http://www.aixm.aero/schema/5.1/message"
xmlns:aixm="http://www.aixm.aero/schema/5.1" 
xmlns:event="http://www.aixm.aero/schema/5.1/event" 
xmlns:gts="http://www.isotc211.org/2005/gts" 
xmlns:gco="http://www.isotc211.org/2005/gco"
xmlns:gmd="http://www.isotc211.org/2005/gmd" 
xmlns:xlink="http://www.w3.org/1999/xlink" 
xmlns:gss="http://www.isotc211.org/2005/gss"
xmlns:gsr="http://www.isotc211.org/2005/gsr"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:gml="http://www.opengis.net/gml/3.2" 
xmlns:fnse="http://www.aixm.aero/schema/5.1/extensions/FAA/FNSE" 
xmlns:fns="urn:us.gov.dot.faa.aim.fns" 
xmlns:ns1="http://www.opengis.net/ows/1.1" 
xmlns:ns3="http://www.opengis.net/wfs/2.0" 
xmlns:ns4="http://www.opengis.net/fes/2.0" 
xmlns:ns14="http://www.opengis.net/wfs-util/2.0" 
numberReturned="21468" timeStamp="2025-09-12T17:24:02.017Z" >
<aixm:member><AIXMBasicMessage gml:id="NMS_ID_1757609538792382"><gml:boundedBy xsi:nil="true"/><hasMember><aixm:RunwayDirection gml:id="RWYDIR01_1757609538792382"><gml:identifier codeSpace="urn:uuid:">15b52516-d780-48fb-bdf7-291d5733fe97</gml:identifier><gml:boundedBy xsi:nil="true"/><aixm:timeSlice><aixm:RunwayDirectionTimeSlice gml:id="RWYDIR01_TS01_1757609538792382"><gml:validTime><gml:TimeInstant gml:id="RWYDIR01_TS01_TI01_1757609538792382"><gml:timePosition>2025-08-21T02:34:44.784Z</gml:timePosition></gml:TimeInstant></gml:validTime><aixm:interpretation>SNAPSHOT</aixm:interpretation><aixm:designator>20</aixm:designator><aixm:usedRunway xlink:href="#Runway_1_1757609538792382"/><aixm:extension><event:RunwayDirectionExtension gml:id="RDE_EVENT_1_1757609538792382"><event:theEvent xlink:href="#Event_1_1757609538792382"/></event:RunwayDirectionExtension></aixm:extension></aixm:RunwayDirectionTimeSlice></aixm:timeSlice></aixm:RunwayDirection></hasMember><hasMember><aixm:Runway gml:id="Runway_1_1757609538792382"><gml:identifier codeSpace="urn:uuid:">631cdd51-0944-46c0-aa9c-e4569f8b0a6b</gml:identifier><gml:boundedBy xsi:nil="true"/><aixm:timeSlice><aixm:RunwayTimeSlice gml:id="Runway_TS_1_1757609538792382"><gml:validTime><gml:TimeInstant gml:id="Runway_TS_I_1_1757609538792382"><gml:timePosition>2025-08-21T02:34:44.784Z</gml:timePosition></gml:TimeInstant></gml:validTime><aixm:interpretation>SNAPSHOT</aixm:interpretation><aixm:designator>02/20</aixm:designator><aixm:associatedAirportHeliport xlink:href="#Airport_1_1757609538792382"/><aixm:extension><event:RunwayExtension gml:id="RE_EVENT_1_1757609538792382"><event:theEvent xlink:href="#Event_1_1757609538792382"/></event:RunwayExtension></aixm:extension></aixm:RunwayTimeSlice></aixm:timeSlice></aixm:Runway></hasMember><hasMember><aixm:RunwayElement gml:id="RE1_1757609538792382"><gml:identifier codeSpace="urn:uuid:">cee68773-faf6-43a4-8314-cf4dd8cd5fa4</gml:identifier><gml:boundedBy xsi:nil="true"/><aixm:timeSlice><aixm:RunwayElementTimeSlice gml:id="RE01_TS1_1757609538792382"><gml:validTime><gml:TimeInstant gml:id="RE_TI1_1757609538792382"><gml:timePosition>2025-08-21T02:34:44.784Z</gml:timePosition></gml:TimeInstant></gml:validTime><aixm:interpretation>SNAPSHOT</aixm:interpretation><aixm:associatedRunway xlink:href="#Runway_1_1757609538792382"/><aixm:extent><aixm:ElevatedSurface gml:id="ES1_1757609538792382" srsDimension="2" srsName="urn:ogc:def:crs:EPSG::4326"><gml:patches><gml:PolygonPatch><gml:exterior><gml:LinearRing><gml:posList>37.9240226820457 -90.7338195078916 37.9239697067978 -90.7336224367121 37.9343677864238 -90.7291485077434 37.9344207690863 -90.7293456035274 37.9240226820457 -90.7338195078916</gml:posList></gml:LinearRing></gml:exterior></gml:PolygonPatch></gml:patches></aixm:ElevatedSurface></aixm:extent><aixm:extension><event:RunwayElementExtension gml:id="REE_EVENT_1_1757609538792382"><event:theEvent xlink:href="#Event_1_1757609538792382"/></event:RunwayElementExtension></aixm:extension></aixm:RunwayElementTimeSlice></aixm:timeSlice></aixm:RunwayElement></hasMember><hasMember><aixm:AirportHeliport gml:id="Airport_1_1757609538792382"><gml:identifier codeSpace="urn:uuid:">b7a0209e-942f-4d7e-ae8b-c708fce65328</gml:identifier><gml:boundedBy xsi:nil="true"/><aixm:timeSlice><aixm:AirportHeliportTimeSlice gml:id="Airport_TS_1_1757609538792382"><gml:validTime><gml:TimeInstant gml:id="Airport_TS_TI_1_1757609538792382"><gml:timePosition>2025-08-21T02:34:44.784Z</gml:timePosition></gml:TimeInstant></gml:validTime><aixm:interpretation>SNAPSHOT</aixm:interpretation><aixm:designator>8WC</aixm:designator><aixm:name>WASHINGTON COUNTY</aixm:name><aixm:ARP><aixm:ElevatedPoint gml:id="EP01_1757609538792382" srsDimension="2" srsName="urn:ogc:def:crs:EPSG::4326"><gml:pos>37.92919525 -90.7314840277778</gml:pos></aixm:ElevatedPoint></aixm:ARP><aixm:extension><event:AirportHeliportExtension gml:id="AHE_EVENT_1_1757609538792382"><event:theEvent xlink:href="#Event_1_1757609538792382"/></event:AirportHeliportExtension></aixm:extension></aixm:AirportHeliportTimeSlice></aixm:timeSlice></aixm:AirportHeliport></hasMember><hasMember><event:Event gml:id="Event_1_1757609538792382"><gml:identifier codeSpace="urn:uuid:">28c2b867-2028-4d12-b43c-8c0bb0525532</gml:identifier><gml:boundedBy xsi:nil="true"/><event:timeSlice><event:EventTimeSlice gml:id="Event_TS_1_1757609538792382"><gml:validTime><gml:TimePeriod gml:id="Event_TS_TP_1_1757609538792382"><gml:beginPosition>2025-08-21T02:34:00.000Z</gml:beginPosition><gml:endPosition>2025-10-01T23:59:00.000Z</gml:endPosition></gml:TimePeriod></gml:validTime><aixm:interpretation>BASELINE</aixm:interpretation><aixm:sequenceNumber>1</aixm:sequenceNumber><aixm:correctionNumber>0</aixm:correctionNumber><event:scenario>87</event:scenario><event:textNOTAM><event:NOTAM gml:id="NOTAM_1_1757609538792382"><event:number>430</event:number><event:year>2025</event:year><event:type>N</event:type><event:issued>2025-08-21T02:34:00.000Z</event:issued><event:location>8WC</event:location><event:effectiveStart>202508210234</event:effectiveStart><event:effectiveEnd>202510012359</event:effectiveEnd><event:text>RWY 20 RWY END ID LGT U/S</event:text><event:translation><event:NOTAMTranslation gml:id="NT01_1757609538792382"><event:type>LOCAL_FORMAT</event:type><event:simpleText>!STL 08/430 8WC RWY 20 RWY END ID LGT U/S 2508210234-2510012359</event:simpleText></event:NOTAMTranslation></event:translation></event:NOTAM></event:textNOTAM><event:extension><fnse:EventExtension gml:id="ext_01_1757609538792382"><fnse:classification>DOM</fnse:classification><fnse:accountId>STL</fnse:accountId><fnse:airportname>WASHINGTON COUNTY</fnse:airportname><fnse:lastUpdated>2025-08-21T02:34:00.000Z</fnse:lastUpdated></fnse:EventExtension></event:extension></event:EventTimeSlice></event:timeSlice></event:Event></hasMember></AIXMBasicMessage></aixm:member>
<aixm:member><AIXMBasicMessage gml:id="NMS_ID_1757609468919567"><gml:boundedBy xsi:nil="true"/><hasMember><event:Event gml:id="Event_1_1757609468919567"><gml:identifier codeSpace="urn:uuid:">814da89f-17ab-445c-abd6-fcbcbedae766</gml:identifier><gml:boundedBy xsi:nil="true"/><event:timeSlice><event:EventTimeSlice gml:id="Event_TS_1_1757609468919567"><gml:validTime><gml:TimePeriod gml:id="Event_TS_TP_1_1757609468919567"><gml:beginPosition>2025-05-01T11:00:00.000Z</gml:beginPosition><gml:endPosition>2025-11-02T00:01:00.000Z</gml:endPosition></gml:TimePeriod></gml:validTime><aixm:interpretation>BASELINE</aixm:interpretation><aixm:sequenceNumber>1</aixm:sequenceNumber><aixm:correctionNumber>0</aixm:correctionNumber><event:scenario>101</event:scenario><event:textNOTAM><event:NOTAM gml:id="NOTAM_1_1757609468919567"><event:number>221</event:number><event:year>2025</event:year><event:type>N</event:type><event:issued>2025-04-30T22:28:00.000Z</event:issued><event:location>ZBW</event:location><event:effectiveStart>202505011100</event:effectiveStart><event:effectiveEnd>202511020001</event:effectiveEnd><event:schedule>Daily:1100-0001~DLY 1100-0001</event:schedule><event:text>AIRSPACE UAS WI AN AREA DEFINED AS 1.5NM RADIUS OF 430205N0753903W (12.2NM NW VGC) SFC-1200FT AGL DLY 1100-0001</event:text><event:translation><event:NOTAMTranslation gml:id="NT01_1757609468919567"><event:type>LOCAL_FORMAT</event:type><event:simpleText>!BDR 04/221 ZBW AIRSPACE UAS WI AN AREA DEFINED AS 1.5NM RADIUS OF 430205N0753903W (12.2NM NW VGC) SFC-1200FT AGL DLY 1100-0001 2505011100-2511020001</event:simpleText></event:NOTAMTranslation></event:translation></event:NOTAM></event:textNOTAM><event:extension><fnse:EventExtension gml:id="ext_01_1757609468919567"><fnse:classification>DOM</fnse:classification><fnse:accountId>BDR</fnse:accountId><fnse:airportname>ZBW ARTCC</fnse:airportname><fnse:lastUpdated>2025-04-30T22:28:00.000Z</fnse:lastUpdated><fnse:icaoLocation>KZBW</fnse:icaoLocation></fnse:EventExtension></event:extension></event:EventTimeSlice></event:timeSlice></event:Event></hasMember></AIXMBasicMessage></aixm:member>
</ns3:FeatureCollection>
</soap:Body>
</soap:Envelope>